tap "homebrew/core"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/bundle"

# Command line tools
cask "iterm2"
brew "bash"
brew "zsh"
brew "git"
brew "telnet"
brew "tmux"
brew "watch"
brew "gotop"
brew "grc"
brew "htop"
brew "jq"
brew "navi"
brew "nmap"

# Development tools
brew "jenv"
cask "temurin"
cask "temurin11"
cask "temurin17"
cask "temurin8"
brew "maven", args: ["ignore-dependencies"]
brew "kafka", args: ["ignore-dependencies"]
brew "python@3.9"
brew "go"
brew "rbenv"
# brew "mysql"
brew "python"

brew "awscli"
# brew "node"
# brew "bitwarden-cli"
# brew "pre-commit"
brew "yamllint"

cask "drawio"
# cask "gitkraken"
cask "google-chrome"
cask "intellij-idea"
cask "obsidian"
cask "omnifocus"
cask "postman"
cask "scroll-reverser"
cask "slack"
cask "soapui"
cask "spotify"
cask "sublime-text"
# cask "visualvm"

# App store
brew "mas"
mas "Bitwarden", id: 1352778147
mas "Magnet", id: 441258766
mas "The Unarchiver", id: 425424353
mas "Trello", id: 1278508951
mas "WhatsApp", id: 1147396723
